package com.zjts.buscenter.util;
/**
 * Created with IntelliJ IDEA.
 * Description:
 * User: zs
 * Date: 2018-10-31
 * Time: 17:06
*/
import com.zjts.buscenter.web.model.Line;
import com.zjts.buscenter.web.model.Station;
import org.apache.commons.lang3.StringUtils;

import java.util.ArrayList;
import java.util.List;

public class LineUtil {


   /* public Line findMessage(String message) {
        String[] msg = message.trim().split("\\^");
        String sendtime = msg[0];
        String ordered = msg[1].split("\\|")[0];
        Line line = new Line();
        if (ordered.equals("LINE")) {
            //routeinfo = analysisStationMessage(sendtime,msg[1]);
            return Line;
        } else {
            return Line;
        }
    }*/
    public static List<Line> run(String s){
        /**
         *line :LINE||LangFang|1||{2路,1507030930,[{廊坊北站东广场,116.700997,39.512219},{市医院,116.702871,39.515945},{明珠大厦,116.702665,39.518478},{市水务局,116.704449,39.519668},{石油通信大厦,116.710571,39.520318},{建筑机械化研究所,116.717086,39.520960},{儿童乐园,116.720251,39.521259},{市公安局,116.721768,39.522890},{特价商城,116.721375,39.526683},{国际饭店,116.720767,39.531165},{移动通信大厦,116.720103,39.536613},{市邮政局,116.720900,39.538330},{第九中学,116.724421,39.538562},{户屯,116.727124,39.541741},{金泰小区,116.726137,39.547816},{金泰小区北门,116.728613,39.551668},{阳光佳和,116.732594,39.552621},{梨园南,116.735471,39.553107},{美好水业,116.739428,39.553932},{小长亭西,116.744684,39.555050},{小长亭东,116.750866,39.556077},{友谊路口,116.756929,39.558087},{憩园新区西门,116.755800,39.562067},{憩园新区,116.757198,39.563638},{新世纪中学,116.759334,39.566152},{开发区供电中心,116.757443,39.570164},{云鹏道派出所,116.755475,39.577293},{四海路北口,116.754005,39.583019},{开发区汽车站北,116.761324,39.588028},{开发区汽车站,116.762988,39.586700},{利仁电器,116.763462,39.582617},{邮政培训中心,116.763868,39.578638},{新奥集团,116.765545,39.577972},{开发区工商局,116.770624,39.578811},{公交四公司腾讯基地,116.770627,39.583268},{开发区高速路口,116.769265,39.588354},{小甸屯,116.777364,39.590488},{南营,116.785741,39.591516},{南营,116.785828,39.591394},{小甸屯,116.778821,39.590803},{开发区高速路口,116.768992,39.588093},{公交四公司腾讯基地,116.770918,39.580829},{开发区工商局,116.770472,39.578922},{新奥集团,116.764997,39.578026},{邮政培训中心,116.764021,39.579190},{利仁电器,116.763704,39.582174},{开发区汽车站,116.763262,39.586203},{开发区汽车站北,116.762222,39.588356},{四海路北口,116.753718,39.583558},{云鹏道派出所,116.755513,39.577016},{开发区供电中心,116.757435,39.570212},{新世纪中学,116.759787,39.565812},{憩园新区,116.757087,39.563883},{憩园新区西门,116.755620,39.561908},{友谊路口,116.755862,39.557191},{小长亭东,116.748763,39.555939},{小长亭西,116.745553,39.555287},{美好水业,116.740531,39.554362},{梨园南,116.736175,39.553451},{阳光佳和,116.732313,39.552717},{金泰小区北门,116.728452,39.551794},{金泰小区,116.726112,39.547382},{户屯,116.726914,39.542174},{第九中学,116.725352,39.538840},{市邮政局,116.721703,39.538585},{移动通信大厦,116.720076,39.535748},{国际饭店,116.720745,39.530352},{特价商城,116.721205,39.525942},{市公安局,116.721660,39.522603},{儿童乐园,116.719751,39.521355},{建筑机械化研究所,116.716555,39.520996},{石油通信大厦,116.710214,39.519907},{市水务局,116.704900,39.519950},{明珠大厦,116.702452,39.518318},{市医院,116.702710,39.515806},{廊坊北站东广场,116.701535,39.512315}],[{21,2路,[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37],[38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75]}],[05:00,23:30,05:00,23:30]}$
         */
        String lineMessage = s.trim().split("\\^")[1];
        //命令子项
        //message.split("\\|")[0];
        //车辆登记城市  LangFang
        String city = lineMessage.split("\\|")[2];
        //数据源id  1
        String dataSource = lineMessage.split("\\|")[3];
        /**
         *sp[0] {2路
          sp[1] 1507030930
          sp[2] [{廊坊北站东广场,116.700997,39.512219},{市医院,116.702871,39.515945},{明珠大厦,116.702665,39.518478},{市水务局,116.704449,39.519668},{石油通信大厦,116.710571,39.520318},{建筑机械化研究所,116.717086,39.520960},{儿童乐园,116.720251,39.521259},{市公安局,116.721768,39.522890},{特价商城,116.721375,39.526683},{国际饭店,116.720767,39.531165},{移动通信大厦,116.720103,39.536613},{市邮政局,116.720900,39.538330},{第九中学,116.724421,39.538562},{户屯,116.727124,39.541741},{金泰小区,116.726137,39.547816},{金泰小区北门,116.728613,39.551668},{阳光佳和,116.732594,39.552621},{梨园南,116.735471,39.553107},{美好水业,116.739428,39.553932},{小长亭西,116.744684,39.555050},{小长亭东,116.750866,39.556077},{友谊路口,116.756929,39.558087},{憩园新区西门,116.755800,39.562067},{憩园新区,116.757198,39.563638},{新世纪中学,116.759334,39.566152},{开发区供电中心,116.757443,39.570164},{云鹏道派出所,116.755475,39.577293},{四海路北口,116.754005,39.583019},{开发区汽车站北,116.761324,39.588028},{开发区汽车站,116.762988,39.586700},{利仁电器,116.763462,39.582617},{邮政培训中心,116.763868,39.578638},{新奥集团,116.765545,39.577972},{开发区工商局,116.770624,39.578811},{公交四公司腾讯基地,116.770627,39.583268},{开发区高速路口,116.769265,39.588354},{小甸屯,116.777364,39.590488},{南营,116.785741,39.591516},{南营,116.785828,39.591394},{小甸屯,116.778821,39.590803},{开发区高速路口,116.768992,39.588093},{公交四公司腾讯基地,116.770918,39.580829},{开发区工商局,116.770472,39.578922},{新奥集团,116.764997,39.578026},{邮政培训中心,116.764021,39.579190},{利仁电器,116.763704,39.582174},{开发区汽车站,116.763262,39.586203},{开发区汽车站北,116.762222,39.588356},{四海路北口,116.753718,39.583558},{云鹏道派出所,116.755513,39.577016},{开发区供电中心,116.757435,39.570212},{新世纪中学,116.759787,39.565812},{憩园新区,116.757087,39.563883},{憩园新区西门,116.755620,39.561908},{友谊路口,116.755862,39.557191},{小长亭东,116.748763,39.555939},{小长亭西,116.745553,39.555287},{美好水业,116.740531,39.554362},{梨园南,116.736175,39.553451},{阳光佳和,116.732313,39.552717},{金泰小区北门,116.728452,39.551794},{金泰小区,116.726112,39.547382},{户屯,116.726914,39.542174},{第九中学,116.725352,39.538840},{市邮政局,116.721703,39.538585},{移动通信大厦,116.720076,39.535748},{国际饭店,116.720745,39.530352},{特价商城,116.721205,39.525942},{市公安局,116.721660,39.522603},{儿童乐园,116.719751,39.521355},{建筑机械化研究所,116.716555,39.520996},{石油通信大厦,116.710214,39.519907},{市水务局,116.704900,39.519950},{明珠大厦,116.702452,39.518318},{市医院,116.702710,39.515806},{廊坊北站东广场,116.701535,39.512315}],[{21,2路,[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37],[38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75]}],[05:00,23:30,05:00,23:30]}$
         */
        String[] split = lineMessage.split("\\|")[5].split(",", 3);

        //线路对象
        Line line = new Line();
        //路线名 2路
        String lineName = split[0].substring(1);
        line.setLineName(lineName);

        //路线版本号 1507030930
        String lineVersion = split[1];
        line.setLineVersion(lineVersion);

        //split1[0] 站点信息 split1[1] 站点索引信息 和 时间
        /**
         * sp1[0] [{廊坊北站东广场,116.700997,39.512219},{市医院,116.702871,39.515945},{明珠大厦,116.702665,39.518478},{市水务局,116.704449,39.519668},{石油通信大厦,116.710571,39.520318},{建筑机械化研究所,116.717086,39.520960},{儿童乐园,116.720251,39.521259},{市公安局,116.721768,39.522890},{特价商城,116.721375,39.526683},{国际饭店,116.720767,39.531165},{移动通信大厦,116.720103,39.536613},{市邮政局,116.720900,39.538330},{第九中学,116.724421,39.538562},{户屯,116.727124,39.541741},{金泰小区,116.726137,39.547816},{金泰小区北门,116.728613,39.551668},{阳光佳和,116.732594,39.552621},{梨园南,116.735471,39.553107},{美好水业,116.739428,39.553932},{小长亭西,116.744684,39.555050},{小长亭东,116.750866,39.556077},{友谊路口,116.756929,39.558087},{憩园新区西门,116.755800,39.562067},{憩园新区,116.757198,39.563638},{新世纪中学,116.759334,39.566152},{开发区供电中心,116.757443,39.570164},{云鹏道派出所,116.755475,39.577293},{四海路北口,116.754005,39.583019},{开发区汽车站北,116.761324,39.588028},{开发区汽车站,116.762988,39.586700},{利仁电器,116.763462,39.582617},{邮政培训中心,116.763868,39.578638},{新奥集团,116.765545,39.577972},{开发区工商局,116.770624,39.578811},{公交四公司腾讯基地,116.770627,39.583268},{开发区高速路口,116.769265,39.588354},{小甸屯,116.777364,39.590488},{南营,116.785741,39.591516},{南营,116.785828,39.591394},{小甸屯,116.778821,39.590803},{开发区高速路口,116.768992,39.588093},{公交四公司腾讯基地,116.770918,39.580829},{开发区工商局,116.770472,39.578922},{新奥集团,116.764997,39.578026},{邮政培训中心,116.764021,39.579190},{利仁电器,116.763704,39.582174},{开发区汽车站,116.763262,39.586203},{开发区汽车站北,116.762222,39.588356},{四海路北口,116.753718,39.583558},{云鹏道派出所,116.755513,39.577016},{开发区供电中心,116.757435,39.570212},{新世纪中学,116.759787,39.565812},{憩园新区,116.757087,39.563883},{憩园新区西门,116.755620,39.561908},{友谊路口,116.755862,39.557191},{小长亭东,116.748763,39.555939},{小长亭西,116.745553,39.555287},{美好水业,116.740531,39.554362},{梨园南,116.736175,39.553451},{阳光佳和,116.732313,39.552717},{金泰小区北门,116.728452,39.551794},{金泰小区,116.726112,39.547382},{户屯,116.726914,39.542174},{第九中学,116.725352,39.538840},{市邮政局,116.721703,39.538585},{移动通信大厦,116.720076,39.535748},{国际饭店,116.720745,39.530352},{特价商城,116.721205,39.525942},{市公安局,116.721660,39.522603},{儿童乐园,116.719751,39.521355},{建筑机械化研究所,116.716555,39.520996},{石油通信大厦,116.710214,39.519907},{市水务局,116.704900,39.519950},{明珠大厦,116.702452,39.518318},{市医院,116.702710,39.515806},{廊坊北站东广场,116.701535,39.512315}
           sp2[1] {21,2路,[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37],[38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75]}],[05:00,23:30,05:00,23:30]}$
         */
        String[] split1 = split[2].split("],\\[", 2);

        //截取的站点信息   split2内为站点信息
        /**
         * sp2[...] [{廊坊北站东广场,116.700997,39.512219 ....站点信息... 廊坊北站东广场,116.701535,39.512315}
         */
        String[] split2 = split1[0].split("},\\{");

//************以下是站点索引信息**************
        //如果是环线 设置上行跑法号
        Integer upRunMethod = 0;
        //如果是环线 设置下行跑法号
        Integer downRunMethod = 0;

        //判断 是否为环线
        if (split1[1].indexOf("},{") != -1) {
            //设置为环线
            line.setCircle(true);
            //截取 线路 split3 [0] 为第一条线路数据 [1]为第二条线路数据
            /**
             *sp3[0] {11,1路,[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,0],[]
             sp3[1]  12,1路,[],[30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,30]}],[05:00,23:30,05:00,23:30]}$
             */
            String[] split3 = split1[1].split("},\\{");
            //str1 为第一条索引数据  11,1路,[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,0],[]
            String str1 = StringUtils.remove(split3[0], "{");

            if (str1.indexOf("],[") != -1) {
                //str1_1 : [0]路线信息+上行索引 [1]下行索引
                String[] str1_1 = str1.split("],\\[");
                String[] indexArr1 = str1_1[0].split("\\[");
                //设置 跑法号
                line.setRunMethod(Integer.valueOf(indexArr1[0].split(",")[0]));
                upRunMethod=line.getRunMethod();
                if (indexArr1[1].indexOf(",")!=-1){
                    line.setUpList(indexArr1[1]);
                }
                if (str1_1[1].indexOf(",") != -1) {
                    line.setDownList(str1_1[1].replace("]",""));
                }
            } else {//单条索引 11,1路,[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,0]
                String[] strIndex = str1.split(",\\[");
                line.setRunMethod(Integer.valueOf(strIndex[0].split(",")[0]));
                if (strIndex[1].indexOf(",")!=-1){
                    line.setUpList(strIndex[1].replace("]",""));
                }
            }

            //******** str1  为第一条索引数据 ↑ **********

            //******** str2  为第二条索引数据+时间 ↓**********
            /**
             * sp3[1]  12,1路,[],[30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,30]}],[05:00,23:30,05:00,23:30]}$
             */
            String str2 = StringUtils.remove(split3[1], "]}$");
            String[] strmag = str2.split("]}],\\[");
            line.setOperationTime("[夏季:"+strmag[1].split(",")[0]+","+strmag[1].split(",")[1]+"],[冬季:"+strmag[1].split(",")[2]+","+strmag[1].split(",")[3]+"]");
            //str3 为第二条索引数据  12,1路,[],[30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,30
            String str3 = strmag[0];
            if (str3.indexOf("],[") != -1) {
                //str2_2 : [0]路线信息+上行索引 [1]下行索引
                String[] str2_2 = str3.split("],\\[");
                //设置跑法号
                line.setRunMethod(Integer.valueOf(str2_2[0].split(",")[0]));
                downRunMethod = line.getRunMethod();
                if (str2_2[0].split(",")[2].indexOf(",")!=-1){
                    line.setUpList(str2_2[0].split(",")[2].replace("]",""));
                }

                if (str2_2[1].indexOf(",") != -1) {
                    line.setDownList(str2_2[1]);
                }
            } else { //单条
                //upindex : 索引信息+路线信息  12,1路,[30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,30

                line.setRunMethod(Integer.valueOf(str3.split(",\\[")[0].split(",")[0]));
                if (str3.split(",\\[")[1].indexOf(",")!=-1){
                    line.setUpList(str3.split(",\\[")[1]);
                }
            }
        } else {//单条路线 信息
            line.setCircle(false);
            //sp3 : [0]路线索引信息+路线信息 [1] 班车时间
            /**
             *sp3[0] {21,2路,[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37],[38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75
             sp3[1]  05:00,23:30,05:00,23:30]}$
             */
            String[] split3 = split1[1].split("]}],\\[");
            String strTime = StringUtils.remove(split3[1], "]}$");
            //设置时间
            line.setOperationTime("[夏季:"+strTime.split(",")[0]+","+strTime.split(",")[1]+"],[冬季:"+strTime.split(",")[2]+","+strTime.split(",")[3]+"]");

            //分解 sp3[0]
            if (split3[0].indexOf("],[") != -1) {
                //mag1 : [0]路线信息+第一组索引 [1]第二组索引
                String[] mag1 = split3[0].split("],\\[");
                line.setRunMethod(Integer.valueOf(StringUtils.remove(mag1[0].split(",")[0],"{")));
                downRunMethod = line.getRunMethod();
                line.setUpList(mag1[0].split(",\\[")[1]);
                line.setDownList(mag1[1]);
            } else {
                //mag2 [0] 路线信息 [1]索引信息
                //{21,2路,[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37]
                String[] mag2 = split3[0].split(",\\[");
                line.setRunMethod(Integer.valueOf(StringUtils.remove(mag2[0].split(",")[0], "{")));

                if (mag2[1].indexOf(",") != -1) {
                    line.setUpList(mag2[1]);
                }
            }
        }

//***********以下是站点信息*************
//所有站点对象集合
        List<Station> stationList = new ArrayList<>();

        for (int i = 0; i < split2.length; i++) {
            if (i == 0) {//开头去 "[{" 符号
                /**
                 * start 起始站（上行）
                 *         廊坊北站东广场,116.700997,39.512219
                 */
                String start = StringUtils.remove(split2[i], "[{");
                //站点对象
                Station station = new Station();
                //站名
                station.setSiteName(start.split(",")[0]);
                //坐标
                station.setLat(Double.valueOf(start.split(",")[1]));
                station.setLon(Double.valueOf(start.split(",")[2]));
                station.setRunMethod(line.getRunMethod());
                //station.setRunMethod();
                //将该对象加入集合中
                stationList.add(station);
            } else if (i == split2.length - 1 && i != 0) {//最后去 "}" 符号
                /**
                 * end 终点站（下行）
                 *          廊坊北站东广场,116.701535,39.512315
                 */
                String end = StringUtils.remove(split2[i], "}");
                //站点对象
                Station station = new Station();
                station.setSiteName(end.split(",")[0]);
                station.setLat(Double.valueOf(end.split(",")[1]));
                station.setLon(Double.valueOf(end.split(",")[2]));
                station.setRunMethod(line.getRunMethod());
                //将该对象加入集合中
                stationList.add(station);
            } else if (i != 0 && i != split2.length - 1) {
                /**
                 * all 所有站点
                 */
                String all = split2[i];
                //站点对象
                Station station = new Station();
                station.setSiteName(all.split(",")[0]);
                station.setLat(Double.valueOf(all.split(",")[1]));
                station.setLon(Double.valueOf(all.split(",")[2]));
                station.setRunMethod(line.getRunMethod());
                //将该对象加入集合中
                stationList.add(station);
            }
        }
        line.setStationList(stationList);
        List<Line> lineList = new ArrayList<>();
        Line line1 = new Line();
        Line line2 = new Line();
        if (line.isCircle()){
            line1.setLineName(line.getLineName());
            line2.setLineName(line.getLineName());
            line1.setLineVersion(line.getLineVersion());
            line2.setLineVersion(line.getLineVersion());
            line1.setOperationTime(line.getOperationTime());
            line2.setOperationTime(line.getOperationTime());
            line1.setCircle(line.isCircle());
            line2.setCircle(line.isCircle());
            line1.setUpList(line.getUpList());
            line2.setDownList(line.getDownList());
            String[] upList = line.getUpList().split(",");
            List<Station> stations1 = new ArrayList<>();
            for (String str: upList) {
                for (int i = 0; i <stationList.size() ; i++) {
                    if (Integer.parseInt(str)==i){
                        stationList.get(i).setRunMethod(upRunMethod);
                        line1.setRunMethod(upRunMethod);
                        stations1.add(stationList.get(i));
                        line1.setStationList(stations1);

                    }
                }
            }

            String[] downList = line.getDownList().split(",");
            List<Station> stations2 = new ArrayList<>();
            for (String str:downList) {
                for (int i = 0; i <stationList.size() ; i++) {
                    if (Integer.parseInt(str)==i){
                        stationList.get(i).setRunMethod(downRunMethod);
                        line2.setRunMethod(downRunMethod);
                        stations2.add(stationList.get(i));
                        line2.setStationList(stations2);

                    }
                }
            }
            lineList.add(line1);
            lineList.add(line2);
        }else {
            lineList.add(line);
        }

        /*System.err.println("线路名称：" +line.getLineName());
        System.err.println("线路版本号："+line.getLineVersion());
        System.err.println("线路跑法号："+line.getRunMethod());
        System.err.println("运营时间：："+line.getOperationTime());
        System.err.println("是否环线："+line.isCircle());
        System.err.println("上行索引集合："+line.getUpList());
        System.err.println("下行索引集合："+line.getDownList());
        for (Station station: line.getStationList()) {
            System.err.println("站点名："+station.getSiteName());
            System.err.println("经度："+station.getLat());
            System.err.println("维度："+station.getLon());
            System.err.println("跑法号："+station.getRunMethod());
        }*/


        return lineList;
    }

}

